
<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184> a <http://linkedpipes.com/ontology/Pipeline>;
    <http://etl.linkedpipes.com/ontology/tag> "3";
    <http://etl.linkedpipes.com/ontology/version> "2"^^<http://www.w3.org/2001/XMLSchema#int>;
    <http://linkedpipes.com/ontology/profile> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/2>;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "03 - Harvestace LKOD a registrací" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/2> a <http://linkedpipes.com/ontology/ExecutionProfile>;
    <http://linkedpipes.com/ontology/rdfRepositoryPolicy> <http://linkedpipes.com/ontology/repository/PerInputRepository>;
    <http://linkedpipes.com/ontology/rdfRepositoryType> <http://linkedpipes.com/ontology/repository/NativeStore> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/100> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/644>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-jsonLdToRdf/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1180;
    <http://linkedpipes.com/ontology/y> 1240;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "JSON-LD to RDF" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/106> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/776>;
    <http://linkedpipes.com/ontology/disabled> true;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-filesFromLocal/0.0.0>;
    <http://linkedpipes.com/ontology/x> 93;
    <http://linkedpipes.com/ontology/y> 247;
    <http://purl.org/dc/terms/description> "Registrace LKOD";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files from local" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/107> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/762>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 519;
    <http://linkedpipes.com/ontology/y> -1;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF Chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/108> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/628>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlUpdateChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2918;
    <http://linkedpipes.com/ontology/y> -303;
    <http://purl.org/dc/terms/description> """Přidat vazbu na číselníky
datových témat EU a EuroVoc""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL update chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/114> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/504>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1560;
    <http://linkedpipes.com/ontology/y> 960;
    <http://purl.org/dc/terms/description> "Konfigurace stažení package_show";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/120> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/114>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/121> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/121> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/645>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1913;
    <http://linkedpipes.com/ontology/y> 1052;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/122> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/123> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/696>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-chunkedToGraph/0.0.0>;
    <http://linkedpipes.com/ontology/x> 562;
    <http://linkedpipes.com/ontology/y> 670;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Chunked merger" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/123> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/733>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1390;
    <http://linkedpipes.com/ontology/y> 120;
    <http://purl.org/dc/terms/description> """Generovat dotazy na datové sady v
LKODech řešených SPARQL endpointem""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/133> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/552>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlUpdateChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2955;
    <http://linkedpipes.com/ontology/y> 210;
    <http://purl.org/dc/terms/description> "Přidat vazbu na NKOD";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL update chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/144> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/79> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/79> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/494>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 662;
    <http://linkedpipes.com/ontology/y> 795;
    <http://purl.org/dc/terms/description> """Konfigurace tvorby
LKOD TriG""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/145> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/506>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlUpdateChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2934;
    <http://linkedpipes.com/ontology/y> -178;
    <http://purl.org/dc/terms/description> """Odstranit prázdné
specifikace časového pokrytí""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL update chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/16> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/577>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-sparqlEndpointChunkedList/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2058;
    <http://linkedpipes.com/ontology/y> 220;
    <http://purl.org/dc/terms/description> """Harvestace LKODů řešených
SPARQL endpointem""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL endpoint chunked list" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/166> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/510>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1743;
    <http://linkedpipes.com/ontology/y> 705;
    <http://purl.org/dc/terms/description> "Turtle";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF Chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/168> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/41>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/169> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/41> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/731>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-chunkedToGraph/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3260;
    <http://linkedpipes.com/ontology/y> -395;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Chunked merger" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/169> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/818>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3498;
    <http://linkedpipes.com/ontology/y> -468;
    <http://purl.org/dc/terms/description> """Příprava na tvorbu
RDF TriG dumpu""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/170> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/169>;
    <http://linkedpipes.com/ontology/targetBinding> "Tasks";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/84> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/84> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/787>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstructToFileList/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3500;
    <http://linkedpipes.com/ontology/y> -362;
    <http://purl.org/dc/terms/description> "Tvorba RDF TriG dumpu";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct to file list" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/172> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/500>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlUpdateChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2617;
    <http://linkedpipes.com/ontology/y> 919;
    <http://purl.org/dc/terms/description> """Kopírovat podmínky užití
z datové sady na distribuce""";
    <http://www.w3.org/2004/02/skos/core#note> "Pokud na distribucích už není. Je to hack pro ty, co nemají specifikovány podmínky užití v CKAN na distribucích v souladu s DCAT-AP";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL update chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/187> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/188>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/189> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/188> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/559>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfGraph/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1463;
    <http://linkedpipes.com/ontology/y> 705;
    <http://purl.org/dc/terms/description> "Turtle";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF single graph" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/189> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/512>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1749;
    <http://linkedpipes.com/ontology/y> 535;
    <http://purl.org/dc/terms/description> """Konfigurace stažení
dcat:Dataset""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/190> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/191>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/166> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/191> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/543>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-httpGetFiles/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1742;
    <http://linkedpipes.com/ontology/y> 623;
    <http://purl.org/dc/terms/description> "Stažení dcat:Dataset";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "HTTP get list" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/197> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/27>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/133> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/27> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/665>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlLinkerChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2440;
    <http://linkedpipes.com/ontology/y> 410;
    <http://purl.org/dc/terms/description> """Vytvořit záznamy datových sad z
LKODů tvořených DCAT-AP Dokumenty""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL linker chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/204> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/205> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/205> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/705>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1477;
    <http://linkedpipes.com/ontology/y> 535;
    <http://purl.org/dc/terms/description> """Konfigurace stažení
LKOD dcat:Catalog""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/210> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/205>;
    <http://linkedpipes.com/ontology/targetBinding> "Configuration";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/211> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/211> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/800>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-httpGetFiles/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1473;
    <http://linkedpipes.com/ontology/y> 618;
    <http://purl.org/dc/terms/description> """Stažení
LKOD dcat:Catalog""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "HTTP get list" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/217> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/211>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/188> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/251> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/697>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfGraph/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1464;
    <http://linkedpipes.com/ontology/y> 777;
    <http://purl.org/dc/terms/description> "JSON-LD";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF single graph" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/256> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/754>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1745;
    <http://linkedpipes.com/ontology/y> 779;
    <http://purl.org/dc/terms/description> "JSON-LD";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF Chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/265> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputFiles";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/266>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/93> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/266> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/778>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-jsonToJsonLd/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1594;
    <http://linkedpipes.com/ontology/y> 1148;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "JSON to JSON-LD" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/93> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/720>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1598;
    <http://linkedpipes.com/ontology/y> 1233;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF Chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/268> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/205>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/189> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/274> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/275> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/275> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/812>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1180;
    <http://linkedpipes.com/ontology/y> 960;
    <http://purl.org/dc/terms/description> "Konfigurace stažení LKOD package_list";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/277> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/191>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/256> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/294> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/211>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/251> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/297> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/89>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/71> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/89> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/498>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-sparqlEndpointList/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1394;
    <http://linkedpipes.com/ontology/y> 211;
    <http://purl.org/dc/terms/description> """Vrátit datové sady z
LKODů řešených
SPARQL endpointem""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL endpoint list to single graph" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/71> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/693>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1776;
    <http://linkedpipes.com/ontology/y> 96;
    <http://purl.org/dc/terms/description> """Vytvořit dotazy na seznamy
datových sad v jednotlivých
LKODech""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/310> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/251>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/189> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/312> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/189>;
    <http://linkedpipes.com/ontology/targetBinding> "Configuration";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/191> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/319> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/275>;
    <http://linkedpipes.com/ontology/targetBinding> "Configuration";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/320> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/320> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/695>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-httpGetFiles/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1180;
    <http://linkedpipes.com/ontology/y> 1060;
    <http://purl.org/dc/terms/description> "Stažení LKOD package_list";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "HTTP get list" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/323> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/275>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/114> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/324> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/320>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/99> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/99> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/712>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-jsonToJsonLd/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1180;
    <http://linkedpipes.com/ontology/y> 1140;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "JSON to JSON-LD" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/326> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/114>;
    <http://linkedpipes.com/ontology/targetBinding> "Configuration";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/327> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/327> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/730>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-httpGetFiles/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1560;
    <http://linkedpipes.com/ontology/y> 1060;
    <http://purl.org/dc/terms/description> "Stažení LKOD package_show";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "HTTP get list" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/329> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/327>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/266> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/345> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/747>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlUpdateChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2884;
    <http://linkedpipes.com/ontology/y> -437;
    <http://purl.org/dc/terms/description> """Odstranit témata datových sad
nepatřících do datových témat EU
či EuroVoc""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL update chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/346> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/520>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlUpdateChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2887;
    <http://linkedpipes.com/ontology/y> -529;
    <http://purl.org/dc/terms/description> """Přidat dcat:DatasetSeries
a dct:hasPart k datovým sériím""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL update chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/349> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/89>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/63> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/63> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/814>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlSelectMulti/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1782;
    <http://linkedpipes.com/ontology/y> 200;
    <http://purl.org/dc/terms/description> """Seznamy datových sad
v LKODech""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL select multiple" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/368> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/345>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/346> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/372> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/108>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/345> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/377> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/346>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/41> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/397> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/121>;
    <http://linkedpipes.com/ontology/targetBinding> "ReferenceRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/86> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/86> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/613>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-propertyLinkerChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1897;
    <http://linkedpipes.com/ontology/y> 1152;
    <http://purl.org/dc/terms/description> "Connect record sources";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Property based linker chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/402> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/521>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2208;
    <http://linkedpipes.com/ontology/y> 726;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF Chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/404> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/616>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlUpdateChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2926;
    <http://linkedpipes.com/ontology/y> -54;
    <http://purl.org/dc/terms/description> "Odstranit prázdná klíčová slova";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL update chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/408> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/523>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-chunkedToTurtle/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1993;
    <http://linkedpipes.com/ontology/y> 716;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Chunked to Turtle" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/409> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/774>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-chunkedToTurtle/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1985;
    <http://linkedpipes.com/ontology/y> 785;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Chunked to Turtle" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/413> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/256>;
    <http://linkedpipes.com/ontology/targetBinding> "InputChunked";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/409> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/423> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputFiles";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/409>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/402> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/424> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/91>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/404> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/91> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/676>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlUpdateChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2947;
    <http://linkedpipes.com/ontology/y> 64;
    <http://purl.org/dc/terms/description> """Odstranit prázdné
kontaktní body""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL update chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/427> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/404>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/145> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/430> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputFiles";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/408>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/402> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/431> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/166>;
    <http://linkedpipes.com/ontology/targetBinding> "InputChunked";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/408> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/434> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/100>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/114> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/435> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/90>;
    <http://linkedpipes.com/ontology/targetBinding> "Tasks";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/16> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/90> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/571>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1792;
    <http://linkedpipes.com/ontology/y> 279;
    <http://purl.org/dc/terms/description> """Generovat dotazy
na datové sady""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/439> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/123>;
    <http://linkedpipes.com/ontology/targetBinding> "Tasks";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/89> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/50> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/8> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/8> a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/502>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstructToFileList/0.0.0>;
    <http://linkedpipes.com/ontology/x> 529;
    <http://linkedpipes.com/ontology/y> 893;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct to file list" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/62> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputFiles";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/63>;
    <http://linkedpipes.com/ontology/targetBinding> "FilesInput";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/16> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/70> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/71>;
    <http://linkedpipes.com/ontology/targetBinding> "Configuration";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/63> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/78> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/79>;
    <http://linkedpipes.com/ontology/targetBinding> "Tasks";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/8> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/83> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/41>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/84> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/88> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/89>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/90> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/92> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/93>;
    <http://linkedpipes.com/ontology/targetBinding> "DataRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/86> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/98> a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputFiles";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/99>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/100> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/195c-bacd>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/195c-bacd/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-textHolder/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3405;
    <http://linkedpipes.com/ontology/y> -9;
    <http://purl.org/dc/terms/description> "Nahrát do GraphDB";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Text holder" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/22ee-bd46>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/22ee-bd46/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2528;
    <http://linkedpipes.com/ontology/y> -184;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF Chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/25b4-85fa>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/25b4-85fa/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlLinkerChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2136;
    <http://linkedpipes.com/ontology/y> 916;
    <http://purl.org/dc/terms/description> """Vytvořit záznamy datových sad z
LKODů tvořených CKAN API""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL linker chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/2b16-9f1f>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/2b16-9f1f/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3332;
    <http://linkedpipes.com/ontology/y> -233;
    <http://purl.org/dc/terms/description> "Datum teď";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3003-bc42>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3003-bc42/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/x-httpRequest/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3713;
    <http://linkedpipes.com/ontology/y> 53;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "HTTP Request" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/31ea-aefe>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/31ea-aefe/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstructChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 479;
    <http://linkedpipes.com/ontology/y> 545;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/37aa-9ac5>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/37aa-9ac5/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-filesFromLocal/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2314;
    <http://linkedpipes.com/ontology/y> -175;
    <http://purl.org/dc/terms/description> "data.gov.sk";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files from local" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3ece-b8b6>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3ece-b8b6/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstructChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2509;
    <http://linkedpipes.com/ontology/y> -14;
    <http://purl.org/dc/terms/description> """Zpracování záznamů
individuálních registrací""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/5683-a369>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/5683-a369/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/l-filesToLocal/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3773;
    <http://linkedpipes.com/ontology/y> -249;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to local" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/697c-b881>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/697c-b881/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlLinkerChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 2498;
    <http://linkedpipes.com/ontology/y> 212;
    <http://purl.org/dc/terms/description> """Zpracovat záznamy z
DCAT-AP SPARQL Endpoint""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL linker chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/7783-bc5c>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/7783-bc5c/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-rdfToFile/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3567;
    <http://linkedpipes.com/ontology/y> -244;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "RDF to file" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/8e40-9463>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/8e40-9463/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-textHolder/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3714;
    <http://linkedpipes.com/ontology/y> -29;
    <http://purl.org/dc/terms/description> "Konfigurace";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Text holder" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/924a-9258>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/924a-9258/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfChunked/0.0.0>;
    <http://linkedpipes.com/ontology/x> 504;
    <http://linkedpipes.com/ontology/y> 444;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF Chunked" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/9c6a-8167>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/9c6a-8167/configuration>;
    <http://linkedpipes.com/ontology/disabled> true;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/e-filesFromLocal/0.0.0>;
    <http://linkedpipes.com/ontology/x> 88;
    <http://linkedpipes.com/ontology/y> 115;
    <http://purl.org/dc/terms/description> "Registrace datasetů";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files from local" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/a714-8c71>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/a714-8c71/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-sparqlConstruct/0.0.0>;
    <http://linkedpipes.com/ontology/x> 1997;
    <http://linkedpipes.com/ontology/y> 529;
    <http://purl.org/dc/terms/description> """Propojení datasetu
a katalogu""";
    <http://www.w3.org/2004/02/skos/core#prefLabel> "SPARQL construct" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b05b-9815>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b05b-9815/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/l-filesToLocal/0.0.0>;
    <http://linkedpipes.com/ontology/x> 668;
    <http://linkedpipes.com/ontology/y> 1013;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to local" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b1cd-8e7f>
    a <http://linkedpipes.com/ontology/Component>;
    <http://linkedpipes.com/ontology/configurationGraph> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b1cd-8e7f/configuration>;
    <http://linkedpipes.com/ontology/template> <http://etl.linkedpipes.com/resources/components/t-filesToRdfGraph/0.0.0>;
    <http://linkedpipes.com/ontology/x> 3399;
    <http://linkedpipes.com/ontology/y> 77;
    <http://www.w3.org/2004/02/skos/core#prefLabel> "Files to RDF single graph" .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/0761-8e8d>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/145>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/108> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/1113-b094>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51>;
    <http://linkedpipes.com/ontology/targetBinding> "ReferenceRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/25b4-85fa>;
    <http://linkedpipes.com/ontology/vertex> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/3ccc-ab5a>,
      <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/e831-883f> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/3ccc-ab5a>
    a <http://linkedpipes.com/ontology/Vertex>;
    <http://linkedpipes.com/ontology/order> 1;
    <http://linkedpipes.com/ontology/x> 1251;
    <http://linkedpipes.com/ontology/y> 898 .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/e831-883f>
    a <http://linkedpipes.com/ontology/Vertex>;
    <http://linkedpipes.com/ontology/order> 2;
    <http://linkedpipes.com/ontology/x> 1990;
    <http://linkedpipes.com/ontology/y> 896 .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/1d12-af9d>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/86>;
    <http://linkedpipes.com/ontology/targetBinding> "DataRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/25b4-85fa> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/25fa-8765>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/16>;
    <http://linkedpipes.com/ontology/targetBinding> "DataRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/697c-b881> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/333c-a7ed>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3ece-b8b6>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/133> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/3908-8449>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/172>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/133> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/3937-9b2e>
    a <http://linkedpipes.com/ontology/RunAfter>;
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/5683-a369>;
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/195c-bacd> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/3b24-9157>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputFile";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/7783-bc5c>;
    <http://linkedpipes.com/ontology/targetBinding> "FilesInput";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/5683-a369> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/53bb-8d55>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/25b4-85fa>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/172> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/5b2e-9cff>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/106>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/924a-9258> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/6294-ab3f>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/8e40-9463>;
    <http://linkedpipes.com/ontology/targetBinding> "FilesInput";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3003-bc42> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/6770-8163>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/114>;
    <http://linkedpipes.com/ontology/targetBinding> "ReferenceRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/25b4-85fa> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/6d60-aae2>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51>;
    <http://linkedpipes.com/ontology/targetBinding> "ReferenceRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/27>;
    <http://linkedpipes.com/ontology/vertex> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/c2fb-bd2c> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/c2fb-bd2c>
    a <http://linkedpipes.com/ontology/Vertex>;
    <http://linkedpipes.com/ontology/order> 1;
    <http://linkedpipes.com/ontology/x> 1689;
    <http://linkedpipes.com/ontology/y> 467 .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/7004-b27b>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/2b16-9f1f>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/7783-bc5c> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/72ff-935c>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/402>;
    <http://linkedpipes.com/ontology/targetBinding> "DataRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/27> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/73d1-ac36>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51>;
    <http://linkedpipes.com/ontology/targetBinding> "ReferenceRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/697c-b881>;
    <http://linkedpipes.com/ontology/vertex> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/84e8-a0c5>,
      <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/46ce-a2cd> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/84e8-a0c5>
    a <http://linkedpipes.com/ontology/Vertex>;
    <http://linkedpipes.com/ontology/order> 1;
    <http://linkedpipes.com/ontology/x> 1340;
    <http://linkedpipes.com/ontology/y> 359 .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/vertex/46ce-a2cd>
    a <http://linkedpipes.com/ontology/Vertex>;
    <http://linkedpipes.com/ontology/order> 2;
    <http://linkedpipes.com/ontology/x> 2365;
    <http://linkedpipes.com/ontology/y> 365 .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/7ef6-87c8>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputFiles";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/84>;
    <http://linkedpipes.com/ontology/targetBinding> "FilesInput";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/5683-a369> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/8ad4-a25d>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/189>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/a714-8c71> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/92d3-b916>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/31ea-aefe>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/51> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/95f0-92cd>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/37aa-9ac5>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/22ee-bd46> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/9647-9e22>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/9c6a-8167>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/107> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/9a73-a234>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputFiles";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/8>;
    <http://linkedpipes.com/ontology/targetBinding> "FilesInput";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b05b-9815> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/a6c4-909c>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/22ee-bd46>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/133> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/ab91-8733>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/133>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/91> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/b6a7-9742>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/924a-9258>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/31ea-aefe> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/cd44-a498>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/107>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3ece-b8b6> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/ddf4-a104>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "FilesOutput";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/195c-bacd>;
    <http://linkedpipes.com/ontology/targetBinding> "InputFiles";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b1cd-8e7f> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/e7dc-9a0e>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/697c-b881>;
    <http://linkedpipes.com/ontology/targetBinding> "InputRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/133> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/eecc-af66>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b1cd-8e7f>;
    <http://linkedpipes.com/ontology/targetBinding> "Task";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3003-bc42> .
  
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/connection/fd3a-9d1b>
    a <http://linkedpipes.com/ontology/Connection>;
    <http://linkedpipes.com/ontology/sourceBinding> "OutputRdf";
    <http://linkedpipes.com/ontology/sourceComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/a714-8c71>;
    <http://linkedpipes.com/ontology/targetBinding> "ReferenceRdf";
    <http://linkedpipes.com/ontology/targetComponent> <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/27> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/521> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/521> a <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSize> 1000;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicateControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReference> false;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReferenceControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeType> "text/turtle";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/613> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/86/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-propertyLinkerChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-propertyLinkerChunked#chunkPredicate> "https://data.gov.sk/slovník/nkod/filePredicate";
    <http://plugins.linkedpipes.com/ontology/t-propertyLinkerChunked#chunkPredicateControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-propertyLinkerChunked#referencePredicate>
      "http://plugins.linkedpipes.com/ontology/e-httpGetFiles#fileName";
    <http://plugins.linkedpipes.com/ontology/t-propertyLinkerChunked#referencePredicateControl>
      <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/616> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/616> a <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
DELETE {
  ?s dcat:keyword ?l
} WHERE {
  ?s dcat:keyword ?l
  FILTER(STRLEN(STR(?l)) = 0 && DATATYPE(?l) = rdf:langString)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/645> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/645> a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX get: <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#>

CONSTRUCT WHERE {   
  ?ref get:fileName ?datasetID ;
     get:fileUri ?source .
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/697> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/697> a <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#commitSize> 50000;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#mimeType> "application/ld+json";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/712> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/99/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#context> "{\"@vocab\":\"https://data.gov.sk/slovník/nkod/\"}";
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#contextControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#dataPredicate> <https://data.gov.sk/slovník/nkod/data>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#dataPredicateControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#encoding> "UTF-8";
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#encodingControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#filePredicate> <https://data.gov.sk/slovník/nkod/filePredicate>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#filePredicateControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#fileReference> true;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#fileReferenceControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#type> <https://data.gov.sk/slovník/nkod/Data>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#typeControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/195c-bacd/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/195c-bacd/configuration>
    a <http://plugins.linkedpipes.com/ontology/e-textHolder#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-textHolder#content> """@prefix req: <http://plugins.linkedpipes.com/ontology/x-httpRequest#> .

<http://localhost/query> a req:Task ;
  req:url \"http://localhost:9080/resources/executions?pipeline=https://sk-nkod.opendata.cz/etl/resources/pipelines/1654065759929\" ;
  req:method \"POST\" ;
  req:content <http://localhost/query/content> .

<http://localhost/query/content> a req:Content ;
  req:name \"configuration\" ;
  req:fileName \"configuration.jsonld\" ;
  req:fileReference \"configuration.jsonld\" .""";
    <http://plugins.linkedpipes.com/ontology/e-textHolder#contentControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-textHolder#fileName> "task.ttl";
    <http://plugins.linkedpipes.com/ontology/e-textHolder#fileNameControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/22ee-bd46/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/22ee-bd46/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSize> 1;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicateControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReference> false;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReferenceControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeType> "";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/25b4-85fa/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/25b4-85fa/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#outputMode> <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#createNewChunk>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#outputModeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX schema: <http://schema.org/>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>
PREFIX get: <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#>

CONSTRUCT {
  ?catalog a dcat:Catalog ;
    dcat:dataset ?dataset ;
    dcat:record ?record .

  ?record a dcat:CatalogRecord ;
    foaf:primaryTopic ?dataset ;
    dcterms:source ?source ;
    dcterms:language <http://publications.europa.eu/resource/authority/language/SVK> ;
    dcterms:conformsTo <https://joinup.ec.europa.eu/collection/semantic-interoperability-community-semic/solution/dcat-application-profile-data-portals-europe/release/201-0> .

  ?dataset a dcat:Dataset ;
    dcterms:title ?titlesk ;
    dcterms:description ?descriptionsk ;
    dcat:distribution ?distributionUri ;
    # Pro další zpracování, dle standardu není legální mít licenci na datasetu
    nkod:license_link ?datasetLicense ;
    dcterms:language ?language ;
    dcat:keyword ?keywordsk ;
    dcat:landingPage ?landingPage ;
    dcterms:identifier ?identifier ;
    dcterms:publisher ?publisher ;
    foaf:page ?pageiri ;
    dcterms:type ?type ;
    dcat:contactPoint ?cp . 
  
  ?publisher a foaf:Agent ;
    foaf:name ?pname .
  
  ?cp a vcard:Organization ;
    vcard:fn ?cpfnsk;
    vcard:hasEmail ?cpemail .

  ?distributionUri a dcat:Distribution ;
    dcterms:title ?dtitlesk ;
    dcterms:description ?ddescriptionsk ;
    dcterms:format ?dformat ;
    dcat:downloadURL ?ddurliri ;
    dcat:accessURL ?ddurliri ;
    dcterms:license ?dlicenseiri ;
    nkod:mediaType ?dmimeType ;
    dcterms:conformsTo ?dconformsToiri .
}
WHERE {
  [] a nkod:Data ;
    nkod:filePredicate ?datasetID ;
    nkod:data ?data .

  ?data nkod:result ?result .

  [] get:fileName ?datasetID ;
     get:fileUri ?source ;
     nkod:catalog ?catalog .

  ?result
    nkod:title ?title ;
    nkod:resources ?distribution .
  
  ?catalog a dcat:Catalog ;
    dcterms:publisher ?publisher .
  
  ?publisher foaf:name ?pname .

  OPTIONAL { ?result nkod:notes ?description . }
  OPTIONAL { ?result nkod:frequency ?accrualPeriodicity . }
  OPTIONAL { ?result nkod:name ?identifier . }
  OPTIONAL { ?result nkod:license_link ?datasetLicense . }
  OPTIONAL { ?result nkod:schema ?page . }
  OPTIONAL { ?result nkod:tags/nkod:name ?keyword . }
  OPTIONAL { ?result nkod:maintainer ?cpfn . }
  OPTIONAL { ?result nkod:maintainer_email ?cpemail .}

  ?distribution nkod:url ?ddurl .
  OPTIONAL { ?distribution nkod:format ?dmimeType . }
  OPTIONAL { ?distribution nkod:license_link ?dlicense . }
  OPTIONAL { ?distribution nkod:name ?dtitle . }

  BIND(IRI(CONCAT(\"https://data.gov.sk/set/dataset/\", ?datasetID)) as ?dataset)
  BIND(IRI(CONCAT(STR(?dataset),\"/distribuce/\",
        MD5(CONCAT(
            ENCODE_FOR_URI(REPLACE(STR(?ddurl),\"[:/\\\\?=#]\",\"-\")),
            IF(BOUND(?dmimeType), CONCAT(\"/\",ENCODE_FOR_URI(?dmimeType)), \"\"),
            IF(BOUND(?dtitle), CONCAT(\"/\",ENCODE_FOR_URI(?dtitle)), \"\")
          ))
      )) as ?distributionUri)
  BIND(IRI(CONCAT(STR(?dataset),\"/záznam\")) as ?record)
  BIND(IRI(CONCAT(STR(?dataset),\"/kontaktní-bod\")) as ?cp)
  BIND(STRLANG(?title, \"sk\") as ?titlesk)
  BIND(STRLANG(?description, \"sk\") as ?descriptionsk)
  BIND(STRLANG(?keyword, \"sk\") as ?keywordsk)
  BIND(STRLANG(?dtitle, \"sk\") as ?dtitlesk)
  BIND(STRLANG(?ddescription, \"sk\") as ?ddescriptionsk)
  BIND(STRLANG(?name, \"sk\") as ?namesk)
  BIND(STRLANG(?cpfn, \"sk\") as ?cpfnsk)
  BIND(IRI(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(?ddurl,\"\\\\\\\"\",\"%22\"),\"\\\\{\",\"%7B\"),\"\\\\}\",\"%7D\"),\"\\\\[\",\"%5B\"),\"\\\\]\",\"%5D\"),\" \",\"%20\")) as ?ddurliri)
  BIND(IRI(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(?page,\"\\\\\\\"\",\"%22\"),\"\\\\{\",\"%7B\"),\"\\\\}\",\"%7D\"),\"\\\\[\",\"%5B\"),\"\\\\]\",\"%5D\"),\" \",\"%20\")) as ?pageiri)
  BIND(IRI(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(?dlicense,\"\\\\\\\"\",\"%22\"),\"\\\\{\",\"%7B\"),\"\\\\}\",\"%7D\"),\"\\\\[\",\"%5B\"),\"\\\\]\",\"%5D\"),\" \",\"%20\")) as ?dlicenseiri)
  BIND(IRI(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(?dconformsTo,\"\\\\\\\"\",\"%22\"),\"\\\\{\",\"%7B\"),\"\\\\}\",\"%7D\"),\"\\\\[\",\"%5B\"),\"\\\\]\",\"%5D\"),\" \",\"%20\")) as ?dconformsToiri)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/2b16-9f1f/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/2b16-9f1f/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX dcterms: <http://purl.org/dc/terms/>
CONSTRUCT { 
  <https://data.gov.sk/set/katalog/NKOD> a dcat:Catalog ;
    dcterms:title \"Národný katalóg otvorených dát\"@sk ;
    dcterms:description \"Národný katalóg otvorených dát\"@sk ;
    dcterms:publisher <http://data.gov.sk/id/legal-subject/50349287> ;
    dcterms:modified ?datumTeď .
} 
WHERE { 
  BIND(STRDT(SUBSTR(STR(NOW()), 1, 10), xsd:date) AS ?datumTeď)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3003-bc42/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3003-bc42/configuration>
    a <http://plugins.linkedpipes.com/ontology/x-httpRequest#Configuration>;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#encodeUrl> false;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#encodeUrlControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#followRedirect> false;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#followRedirectControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#skipOnError> false;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#skipOnErrorControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#threads> 8;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#threadsPerGroup> 1;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#threadsPerGroupControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#timeoutControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#utf8Redirect> false;
    <http://plugins.linkedpipes.com/ontology/x-httpRequest#utf8RedirectControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/31ea-aefe/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/31ea-aefe/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#deduplication> true;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#deduplicationControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

CONSTRUCT { 
  ?catalog a dcat:Catalog, ?type ;
    dcat:endpointURL ?catalog_endpoint ;
    dcterms:title ?title ;
    dcat:contactPoint ?cp ;
    foaf:homepage ?homepage ;
    dcterms:publisher ?publisher .

  ?cp a ?cptype ;
    vcard:fn ?cpfn ;
    vcard:hasEmail ?cpemail .  

  ?publisher a foaf:Agent ;
    foaf:name ?publisher_name .
} 
WHERE {
  ?catalog a dcat:Catalog, ?type ;
    dcat:endpointURL ?catalog_endpoint ;
    dcterms:title ?title ;
    dcterms:publisher ?publisher ;
    dcat:contactPoint ?cp .
  ?publisher a foaf:Agent ;
    foaf:name ?publisher_name .
  ?cp a ?cptype ;
    vcard:fn ?cpfn ;
    vcard:hasEmail ?cpemail .
  OPTIONAL { ?catalog foaf:homepage ?homepage . }
  FILTER ( ?type != dcat:Catalog)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#softFailControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#threadsControl>
      <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/37aa-9ac5/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/37aa-9ac5/configuration>
    a <http://plugins.linkedpipes.com/ontology/e-filesFromLocal#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-filesFromLocal#path> "/data/nkod-sk/data.gov.sk/migrated/data.gov.sk.trig";
    <http://plugins.linkedpipes.com/ontology/e-filesFromLocal#pathControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3ece-b8b6/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/3ece-b8b6/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#deduplication> true;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#deduplicationControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>
PREFIX locn: <http://www.w3.org/ns/locn#>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>

CONSTRUCT {
?dataset a dcat:Dataset ;
    dcterms:title ?title ;
    dcterms:description ?description ;
	dcat:theme ?theme ;
	dcterms:accrualPeriodicity ?accrualPeriodicity ;
	dcat:keyword ?keyword ;
    dcterms:spatial ?spatial ;
    dcterms:temporal ?temporal ;
	dcat:contactPoint ?cp ;
	foaf:page ?page ;
    dcterms:conformsTo ?conformsTo ;
    dcat:spatialResolutionInMeters ?spatialResolution ;
    dcat:temporalResolution ?temporalResolution ;
    dcterms:isPartOf ?topDataset ;
    dcterms:hasPart ?lowerDataset ;
    dcterms:publisher ?publisher ;
	dcterms:identifier ?identifier ;
	dcat:distribution ?distribution .

?spatial a dcterms:Location ;
    locn:geometry ?geo .

?cp a ?cptype; 
    vcard:fn ?cpfn ;
    vcard:hasEmail ?cpemail .

?publisher a foaf:Agent; 
	foaf:name ?name .

?temporal a dcterms:PeriodOfTime; 
    dcat:startDate ?startDate ;
    dcat:endDate ?endDate .

?theme skos:inScheme ?scheme .

?distribution a dcat:Distribution ;
    dcat:downloadURL ?ddURL ;
    dcat:accessURL ?daURL ;
    dcterms:format ?dformat ;
	dcat:mediaType ?dmimeType ;
	dcterms:conformsTo ?dconformsTo ;
    dcat:compressFormat ?dcompressFormat ;
    dcat:packageFormat ?dpackageFormat ;
    dcterms:title ?dtitle ;
	dcterms:license ?license .

?distribution dcat:accessService ?dataService . 
  
?dataService a dcat:DataService ;
    dcterms:title ?sTitle ;
    dcterms:conformsTo ?sConformsTo ;
    dcat:endpointURL ?sEndpointURL ;
    dcat:endpointDescription ?sEndpointDescription ;
    dcat:servesDataset ?dataset .

?record a dcat:CatalogRecord;
    foaf:primaryTopic ?dataset ;
    dcterms:language ?rlanguage ;
    dcterms:conformsTo ?rconformsTo ;
    dcterms:source ?rsource .
}
WHERE {
  {
	?dataset a dcat:Dataset ;
        dcterms:title ?title .
  } UNION {
    ?dataset dcterms:description ?description .
  } UNION { 
    ?dataset dcat:distribution ?distribution .

    ?distribution a dcat:Distribution ;
        dcat:accessURL ?daURL .

    OPTIONAL { ?distribution dcat:downloadURL ?ddURL . }
	OPTIONAL { ?distribution dcterms:license ?license . }
    OPTIONAL { ?distribution dcterms:description ?ddescription . }
    OPTIONAL { ?distribution dcterms:format ?dformat . }
    OPTIONAL { ?distribution dcat:mediaType ?dmimeType . }
    OPTIONAL { ?distribution dcterms:conformsTo ?dconformsTo . }
    OPTIONAL { ?distribution dcat:compressFormat ?dcompressFormat . }
    OPTIONAL { ?distribution dcat:packageFormat ?dpackageFormat . }
    OPTIONAL { ?distribution dcterms:title ?dtitle . }
    OPTIONAL { 
        ?distribution dcat:accessService ?dataService . 
        ?dataService a dcat:DataService ;
                    dcterms:title ?sTitle ;
                    dcat:endpointURL ?sEndpointURL .
        OPTIONAL { ?dataService dcat:endpointDescription ?sEndpointDescription .}
        OPTIONAL { ?dataService dcterms:conformsTo ?sConformsTo .}
    }
  } UNION {
?dataset dcterms:hasPart ?lowerDataset .
  } UNION {
?dataset dcterms:hasPart ?lowerDataset .
  } UNION { ?dataset dcterms:accrualPeriodicity ?accrualPeriodicity .   
  } UNION { ?dataset dcat:keyword ?keyword . 
  } UNION { ?dataset dcterms:spatial ?spatial .
    OPTIONAL { ?spatial locn:geometry ?geometry . }
  } UNION { ?dataset foaf:page ?page . 
  } UNION { ?dataset dcterms:conformsTo ?conformsTo . 
  } UNION { ?dataset dcat:spatialResolutionInMeters ?spatialResolution . 
  } UNION { ?dataset dcat:temporalResolution ?temporalResolution . 
  } UNION { ?dataset dcterms:isPartOf ?topDataset . 
  } UNION { ?dataset dcterms:identifier ?identifier . 
  } UNION { ?dataset dcat:theme ?theme .
	OPTIONAL { ?theme skos:inScheme ?scheme . }
  } UNION { ?dataset dcterms:temporal ?temporal . 
    OPTIONAL { ?temporal dcat:startDate ?startDate . }
    OPTIONAL { ?temporal dcat:endDate ?endDate . }
  } UNION { ?dataset dcat:contactPoint ?cp . 
?cp a ?cptype.
    OPTIONAL { ?cp vcard:fn ?cpfn . }
    OPTIONAL { ?cp vcard:hasEmail ?cpemail . }
  } UNION { 
    ?dataset dcterms:publisher ?publisher . 
	
    ?publisher a foaf:Agent; 
        foaf:name ?name .
    }
 }""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#softFailControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructChunked#threadsControl>
      <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/5683-a369/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/5683-a369/configuration>
    a <http://plugins.linkedpipes.com/ontology/l-filesToLocal#Configuration>;
    <http://plugins.linkedpipes.com/ontology/l-filesToLocal#directoryPermissionsControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/l-filesToLocal#filePermissionsControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/l-filesToLocal#path> "/data/nkod-sk/dumps";
    <http://plugins.linkedpipes.com/ontology/l-filesToLocal#pathControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/697c-b881/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/697c-b881/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#outputMode> <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#createNewChunk>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#outputModeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX schema: <http://schema.org/>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX gr: <http://purl.org/goodrelations/v1#>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>

CONSTRUCT {
  ?catalog dcat:dataset ?dataset_new .

  ?dataset_new a dcat:Dataset ;
    dcterms:title ?title ;
    dcterms:description ?description ;
    dcat:theme ?theme ;
    dcterms:accrualPeriodicity ?accrualPeriodicity ;
    dcat:keyword ?keyword ;
    dcterms:spatial ?spatial ;
    dcterms:temporal ?temporal_new ;
    dcat:contactPoint ?cp_new ;
    foaf:page ?page ;
    dcterms:conformsTo ?conformsTo ;
    dcat:spatialResolutionInMeters ?spatialResolution ;
    dcat:temporalResolution ?temporalResolution ;
    dcterms:isPartOf ?topDatasetNew ;
    dcat:distribution ?distribution_new ;
    dcterms:publisher ?publisher ;
    dcterms:identifier ?dataset_old_str .

  ?cp_new a ?cptype; 
    vcard:fn ?cpfn ;
    vcard:hasEmail ?cpemail .

  ?publisher a foaf:Agent;
    foaf:name ?pname .

  ?temporal_new a dcterms:PeriodOfTime; 
    dcat:startDate ?finalStartDate ;
    dcat:endDate ?finalEndDate .

  ?distribution_new a dcat:Distribution ;
    dcat:downloadURL ?ddURL ;
    dcat:accessURL ?daURL ;
    dcterms:format ?dformat ;
    dcat:mediaType ?dmimeType ;
    dcterms:conformsTo ?dconformsTo ;
    dcat:compressFormat ?dcompressFormat ;
    dcat:packageFormat ?dpackageFormat ;
    dcterms:title ?dtitle ;
    dcterms:license ?license .

  ?distribution_new dcat:accessService ?dataservice_new . 

  ?dataservice_new a dcat:DataService ;
    dcterms:title ?sTitle ;
    dcat:endpointURL ?sEndpointURL ;
    dcterms:conformsTo ?sConformsTo ;
    dcat:endpointDescription ?sEndpointDescription .

  ?record_new a dcat:CatalogRecord;
    dcterms:source ?dataset ;
    foaf:primaryTopic ?dataset_new ;
    dcterms:language <http://publications.europa.eu/resource/authority/language/SVK>,
      <http://publications.europa.eu/resource/authority/language/ENG> ;
    dcterms:conformsTo <https://joinup.ec.europa.eu/collection/semantic-interoperability-community-semic/solution/dcat-application-profile-data-portals-europe/release/201-0> .
}
WHERE {
  ?catalog a dcat:Catalog ;
    dcat:dataset ?dataset ;
    dcterms:publisher ?publisher .

  ?publisher foaf:name ?pname .

  ?dataset a dcat:Dataset ;
             dcterms:title ?title ;
             dcterms:description ?description ;
             dcat:theme ?theme ;
             dcterms:accrualPeriodicity ?accrualPeriodicity ;
             dcat:keyword ?keyword ;
             dcterms:spatial ?spatial .

  OPTIONAL { ?dataset dcterms:temporal ?temporal . 
    OPTIONAL { ?temporal dcat:startDate ?startDate . }
    OPTIONAL { ?temporal dcat:endDate ?endDate . }
    OPTIONAL { ?temporal schema:startDate ?schemaStartDate . }
    OPTIONAL { ?temporal schema:endDate ?schemaEndDate . }
    BIND(IF(BOUND(?startDate), ?startDate, ?schemaStartDate) AS ?finalStartDate)
    BIND(IF(BOUND(?endDate), ?endDate, ?schemaEndDate) AS ?finalEndDate)
  }

  OPTIONAL { ?dataset dcat:contactPoint ?cp . 
    ?cp a ?cptype.
    OPTIONAL { ?cp vcard:fn ?cpfn . }
    OPTIONAL { ?cp vcard:hasEmail ?cpemail . }
  }

  OPTIONAL { ?dataset foaf:page ?page . }
  OPTIONAL { ?dataset dcterms:conformsTo ?conformsTo . }
  OPTIONAL { ?dataset dcat:spatialResolutionInMeters ?spatialResolution . }
  OPTIONAL { ?dataset dcat:temporalResolution ?temporalResolution . }
  OPTIONAL { ?dataset dcterms:isPartOf ?topDataset . }

  OPTIONAL {
    ?dataset dcat:distribution ?distribution .
    ?distribution a dcat:Distribution ;
             dcat:accessURL ?daURL .

    OPTIONAL { ?distribution dcterms:license ?license . }
    OPTIONAL { ?distribution dcat:downloadURL ?ddURL . }
    OPTIONAL { ?distribution dcterms:format ?dformat . }
    OPTIONAL { ?distribution dcat:mediaType ?dmimeType . }
    OPTIONAL { ?distribution dcterms:conformsTo ?dconformsTo . }
    OPTIONAL { ?distribution dcat:compressFormat ?dcompressFormat . }
    OPTIONAL { ?distribution dcat:packageFormat ?dpackageFormat . }
    OPTIONAL { ?distribution dcterms:title ?dtitle . }

    OPTIONAL { 
      ?distribution dcat:accessService ?dataService . 
      ?dataService a dcat:DataService ;
                    dcterms:title ?sTitle ;
                    dcat:endpointURL ?sEndpointURL .

      OPTIONAL { ?dataService dcat:endpointDescription ?sEndpointDescription .}
      OPTIONAL { ?dataService dcterms:conformsTo ?sConformsTo .}
    }
  }

  BIND (STRDT(STR(?dataset), xsd:anyURI) AS ?dataset_old_str)
  BIND (CONCAT(\"https://data.gov.sk/set/dataset/\") AS ?new_IRI_base)
  BIND (MD5(CONCAT(STR(?dataset), STR(?publisher))) AS ?datasetID)
  BIND (IRI(CONCAT(?new_IRI_base, ?datasetID)) as ?dataset_new)
  BIND (IRI(CONCAT(?new_IRI_base, MD5(CONCAT(STR(?topDataset), STR(?publisher))))) as ?topDatasetNew)
  BIND (IRI(CONCAT(\"https://data.gov.sk/set/distribution/\", ?datasetID, \"/\", MD5(STR(?distribution)))) as ?distribution_new)
  BIND (IRI(CONCAT(\"https://data.gov.sk/set/data-service/\", MD5(CONCAT(STR(?dataService), STR(?publisher))))) as ?dataservice_new)
  BIND (IRI(CONCAT(STR(?dataset_new),\"/záznam\")) as ?record_new)
  BIND (IRI(CONCAT(STR(?dataset_new),\"/kontaktný-bod\")) as ?cp_new)
  BIND (IRI(CONCAT(STR(?dataset_new),\"/časové-pokrytie\")) as ?temporal_new)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/7783-bc5c/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/7783-bc5c/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-rdfToFile#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-rdfToFile#fileName> "nkod-metadata.ttl";
    <http://plugins.linkedpipes.com/ontology/t-rdfToFile#fileNameControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-rdfToFile#fileType> "text/turtle";
    <http://plugins.linkedpipes.com/ontology/t-rdfToFile#fileTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-rdfToFile#graphUri> <http://localhost/default>;
    <http://plugins.linkedpipes.com/ontology/t-rdfToFile#graphUriControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/8e40-9463/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/8e40-9463/configuration>
    a <http://plugins.linkedpipes.com/ontology/e-textHolder#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-textHolder#content> "{\"@id\": \"http://localhost/base\",\"@type\" : \"http://etl.linkedpipes.com/ontology/ExecutionOptions\",\"http://linkedpipes.com/ontology/deleteWorkingData\" : false,\"http://linkedpipes.com/ontology/saveDebugData\" : true}";
    <http://plugins.linkedpipes.com/ontology/e-textHolder#contentControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-textHolder#fileName> "configuration.jsonld";
    <http://plugins.linkedpipes.com/ontology/e-textHolder#fileNameControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/924a-9258/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/924a-9258/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSize> 1;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicateControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReference> false;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReferenceControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeType> "";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/9c6a-8167/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/9c6a-8167/configuration>
    a <http://plugins.linkedpipes.com/ontology/e-filesFromLocal#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-filesFromLocal#path> "/data/registrace/datasety";
    <http://plugins.linkedpipes.com/ontology/e-filesFromLocal#pathControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/a714-8c71/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/a714-8c71/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
CONSTRUCT WHERE {
?catalog a dcat:Catalog;
    dcat:dataset ?dataset .
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b05b-9815/configuration> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b05b-9815/configuration>
    a <http://plugins.linkedpipes.com/ontology/l-filesToLocal#Configuration>;
    <http://plugins.linkedpipes.com/ontology/l-filesToLocal#directoryPermissionsControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/l-filesToLocal#filePermissionsControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/l-filesToLocal#path> "/data/nkod-sk/dumps";
    <http://plugins.linkedpipes.com/ontology/l-filesToLocal#pathControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/component/b1cd-8e7f/configuration> {
  <http://etl.linkedpipes.com/resources/components/t-filesToRdfGraph/0.0.0/new/1> a
      <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#commitSize> 50000;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#mimeType> "";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/494> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/79/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX srtfl: <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#>
PREFIX dcat: <http://www.w3.org/ns/dcat#>

CONSTRUCT 
{
<https://localhost/nkod-task> a srtfl:Task ;
    srtfl:fileName \"lkody.trig\" ;
    srtfl:fileFormat \"application/trig\" ;
    srtfl:hasTaskQuery ?tqIRI .

?tqIRI a srtfl:TaskQuery ;
    srtfl:outputGraph ?catalog ;
    srtfl:query ?query .
} 

WHERE 
{ 
?catalog a dcat:Catalog .

BIND(UUID() as ?tqIRI)
BIND(CONCAT(\"\"\"
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

CONSTRUCT { 
  <\"\"\",STR(?catalog),\"\"\"> a dcat:Catalog, ?type ;
    dcat:endpointURL ?catalog_endpoint ;
    dcterms:title ?title ;
    dcat:contactPoint ?cp ;
    foaf:homepage ?homepage ;
    dcterms:publisher ?publisher .

  ?cp a ?cptype ;
    vcard:fn ?cpfn ;
    vcard:hasEmail ?cpemail .  

  ?publisher a foaf:Agent ;
    foaf:name ?publisher_name .
} 
WHERE {
  <\"\"\",STR(?catalog),\"\"\"> a dcat:Catalog, ?type ;
    dcat:endpointURL ?catalog_endpoint ;
    dcterms:title ?title ;
    dcterms:publisher ?publisher ;
    dcat:contactPoint ?cp .
  ?publisher a foaf:Agent ;
    foaf:name ?publisher_name .
  ?cp a ?cptype ;
    vcard:fn ?cpfn ;
    vcard:hasEmail ?cpemail .
  OPTIONAL { <\"\"\",STR(?catalog),\"\"\"> foaf:homepage ?homepage . }
}
\"\"\") as ?query)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/498> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/497> a <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#commitSize> 0;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#encodeRdf> false;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#encodeRdfControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#passwordControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#taskPerGroupLimit> 0;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#taskPerGroupLimitControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#threads> 1;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#timeLimit> -1;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#timeLimitControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#useAuthentication> false;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#useAuthenticationControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#useTolerantRepository>
      false;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#useTolerantRepositoryControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#userNameControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/500> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/172/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dcterms: <http://purl.org/dc/terms/>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>

INSERT { ?distribution dcterms:license ?license .} 
WHERE { 
  ?dataset a dcat:Dataset ;
     nkod:license_link ?link ;
     dcat:distribution ?distribution .
  
  FILTER NOT EXISTS {?distribution dcterms:license [] .}
  BIND(IRI(REPLACE(?link,\" \",\"%20\")) as ?license)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/502> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/8/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#deduplication>
      true;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#deduplicationControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#prefixTurtleControl>
      <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/504> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/114/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX httpList: <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#>
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>

CONSTRUCT {
<http://localhost/resource/configuration> a httpList:Configuration ;
    httpList:reference ?refIRI .

?refIRI a httpList:Reference ;
    httpList:group ?package_list_filename ;
    httpList:fileUri ?package_show ;
    httpList:fileName ?package_show_filename ;
    nkod:catalog ?catalog .
}
WHERE {
  [] a nkod:Data ;
       nkod:filePredicate ?package_list_filename ;
       nkod:data ?list .
  
  ?list nkod:result ?datasetID .
  
  [] httpList:fileName ?package_list_filename ;
     httpList:fileUri ?package_list_uri ;
     nkod:catalog ?catalog .
  
  BIND(REPLACE(STR(?package_list_uri),\"(.*)/[^/]+\",\"$1\") as ?package_show_prefix)
  BIND(IRI(CONCAT(?package_show_prefix,\"/package_show?id=\",?datasetID)) as ?package_show)
  BIND(REPLACE(STR(?package_show),\"[:/\\\\?=]\",\"-\") as ?package_show_filename)
  BIND(IRI(CONCAT(STR(?catalog), \"-\", REPLACE(STR(?package_show),\"[:/\\\\?=]\",\"-\"))) as ?refIRI)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/506> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/505> a <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dcterms: <http://purl.org/dc/terms/>
DELETE { 
  ?dataset dcterms:temporal ?temporal .
} 
WHERE 
{
 ?dataset dcterms:temporal ?temporal .
  FILTER NOT EXISTS { ?temporal dcat:startDate ?startDate .}
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/510> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/509> a <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSize> 1;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicate> <https://etl.linkedpipes.com/plugins/t-filestochunked/fileName>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicateControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReference> false;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReferenceControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeType> "text/turtle";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/512> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/189/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX httpList: <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#>
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>

CONSTRUCT {
<http://localhost/resource/configuration> a httpList:Configuration ;
    httpList:reference ?dataset .

?catalog a dcat:Catalog;
    dcat:dataset ?dataset ;
    dcat:endpointURL ?endpoint .

?dataset a httpList:Reference ;
    httpList:group ?catalog_filename ;
    httpList:fileUri ?dataset ;
    httpList:fileName ?dataset_filename ;
    httpList:header #?acceptHeader, 
      ?agentHeader .
  
#?acceptHeader a httpList:Header ;
#    httpList:key \"Accept\" ;
#    httpList:value \"text/turtle\" .
 
?agentHeader a httpList:Header ;
    httpList:key \"User-Agent\" ;
    httpList:value \"nkod/0.0.1\" .

}
WHERE { 
  ?catalog a dcat:Catalog, httpList:Reference ;
           dcat:endpointURL ?endpoint ;
           httpList:fileName ?catalog_filename .
  
  BIND(IRI(STR(?endpoint)) as ?downloaded_catalog)
  
  ?downloaded_catalog dcat:dataset ?dataset .
     
  BIND(REPLACE(STR(?dataset),\"[:/\\\\?=]\",\"-\") as ?dataset_filename)
  #BIND(IRI(CONCAT(STR(?dataset),\"/accept-header\")) as ?acceptHeader)
  BIND(IRI(CONCAT(STR(?dataset),\"/agent-header\")) as ?agentHeader)

}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/520> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/519> a <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#query> """PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX dcat: <http://www.w3.org/ns/dcat#>
INSERT { 
  ?upper a dcat:DatasetSeries ;
    dcterms:hasPart ?dataset .
} 
WHERE 
{
  ?dataset a dcat:Dataset ;
    dcterms:isPartOf ?upper .
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/523> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/522> a <http://plugins.linkedpipes.com/ontology/t-chunkedToTurtle#Configuration> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/543> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/542> a <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#detailLog> false;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#detailLogControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#encodeUrl> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#encodeUrlControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#hardRedirect> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#hardRedirectControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#retryCountControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#skipOnError> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#skipOnErrorControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threads> 64;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsPerGroup> 10;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsPerGroupControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#timeout> 5000;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#timeoutControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#utf8Redirect> false;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#utf8RedirectControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#waitTimeControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/552> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/133/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
INSERT { 
  <https://data.gov.sk/set/katalog/NKOD> a dcat:Catalog ;
    dcat:record ?record ;
    dcat:dataset ?dataset .
} 
WHERE 
{ 
  ?record a dcat:CatalogRecord;
          foaf:primaryTopic ?dataset .
  ?dataset a dcat:Dataset ;
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/559> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/558> a <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#commitSize> 50000;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#mimeType> "text/turtle";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfGraph#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/571> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/90/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX esl: <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#>
PREFIX dcat: <http://www.w3.org/ns/dcat#>

CONSTRUCT { 
  ?configiri a esl:Task ;
    esl:query ?query ;
    esl:fileName ?filename ;
    esl:endpoint ?endpoint ;
    esl:chunkSize \"20\" .
} 
WHERE 
{ 
  { 
    SELECT DISTINCT ?catalog ?endpoint 
    WHERE {
      ?catalog dcat:endpointURL ?endpoint . 
    } 
  }
   
BIND(CONCAT(\"\"\"
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX schema: <http://schema.org/>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

CONSTRUCT {
  <\"\"\", STR(?catalog), \"\"\"> a dcat:Catalog ;
    dcat:dataset ?dataset .

  ?dataset a dcat:Dataset ;
    dcterms:title ?title ;
    dcterms:description ?description ;
    dcat:theme ?theme ;
    dcterms:accrualPeriodicity ?accrualPeriodicity ;
    dcat:keyword ?keyword ;
    dcterms:spatial ?spatial ;
    dcterms:temporal ?temporal ;
    dcat:contactPoint ?cp ;
    foaf:page ?page ;
    dcterms:conformsTo ?conformsTo ;
    dcat:spatialResolutionInMeters ?spatialResolution ;
    dcat:temporalResolution ?temporalResolution ;
    dcterms:isPartOf ?topDataset ;
    dcat:distribution ?distribution .

  ?cp a ?cptype; 
    vcard:fn ?cpfn ;
    vcard:hasEmail ?cpemail .

  ?temporal a dcterms:PeriodOfTime; 
    dcat:startDate ?finalStartDate ;
    dcat:endDate ?finalEndDate .

  ?distribution a dcat:Distribution ;
    dcat:downloadURL ?ddURL ;
    dcterms:license ?license ;
    dcat:accessURL ?daURL ;
    dcterms:format ?dformat ;
    dcat:mediaType ?dmimeType ;
    dcterms:conformsTo ?dconformsTo ;
    dcat:compressFormat ?dcompressFormat ;
    dcat:packageFormat ?dpackageFormat ;
    dcterms:title ?dtitle .
 
  ?distribution dcat:accessService ?dataService . 

  ?dataService a dcat:DataService ;
    dcterms:title ?sTitle ;
    dcterms:conformsTo ?sConformsTo ;
    dcat:endpointURL ?sEndpointURL ;
    dcat:endpointDescription ?sEndpointDescription .	
}
WHERE { 
  ${VALUES}

  ?dataset a dcat:Dataset ;
    dcterms:title ?title ;
    dcterms:description ?description ;
    dcat:theme ?theme ;
    dcterms:accrualPeriodicity ?accrualPeriodicity ;
    dcat:keyword ?keyword ;
    dcterms:spatial ?spatial .

  OPTIONAL {
    ?dataset dcterms:temporal ?temporal . 
    OPTIONAL { ?temporal dcat:startDate ?startDate . }
    OPTIONAL { ?temporal dcat:endDate ?endDate . }
    OPTIONAL { ?temporal schema:startDate ?schemaStartDate . }
    OPTIONAL { ?temporal schema:endDate ?schemaEndDate . }
  }

  OPTIONAL {
    ?dataset dcat:contactPoint ?cp . 

    ?cp a ?cptype.
    OPTIONAL { ?cp vcard:fn ?cpfn . }
    OPTIONAL { ?cp vcard:hasEmail ?cpemail . }
  }

  OPTIONAL { ?dataset foaf:page ?page . }
  OPTIONAL { ?dataset dcterms:conformsTo ?conformsTo . }
  OPTIONAL { ?dataset dcat:spatialResolutionInMeters ?spatialResolution . }
  OPTIONAL { ?dataset dcat:temporalResolution ?temporalResolution . }
  OPTIONAL { ?dataset dcterms:isPartOf ?topDataset . }

  OPTIONAL {
    ?dataset dcat:distribution ?distribution .
    FILTER(isIRI(?distribution))

    ?distribution a dcat:Distribution ;
             dcat:accessURL ?daURL .

	OPTIONAL { ?distribution dcterms:license ?license .}    
	OPTIONAL { ?distribution dcat:downloadURL ?ddURL . }
    OPTIONAL { ?distribution dcterms:format ?dformat . }
    OPTIONAL { ?distribution dcat:mediaType ?dmimeType . }
    OPTIONAL { ?distribution dcterms:conformsTo ?dconformsTo . }
    OPTIONAL { ?distribution dcat:compressFormat ?dcompressFormat . }
    OPTIONAL { ?distribution dcat:packageFormat ?dpackageFormat . }
    OPTIONAL { ?distribution dcterms:title ?dtitle . }

    OPTIONAL { 
      ?distribution dcat:accessService ?dataService . 
      FILTER(isIRI(?dataService))

      ?dataService a dcat:DataService ;
                    dcterms:title ?sTitle ;
                    dcat:endpointURL ?sEndpointURL .
      OPTIONAL { ?dataService dcat:endpointDescription ?sEndpointDescription .}
      OPTIONAL { ?dataService dcterms:conformsTo ?sConformsTo .}
    }
  }
  BIND(IF(BOUND(?startDate), ?startDate, ?schemaStartDate) AS ?finalStartDate)
  BIND(IF(BOUND(?endDate), ?endDate, ?schemaEndDate) AS ?finalEndDate)
}
\"\"\") as ?query)

	BIND(CONCAT(REPLACE(STR(?catalog),\"[:/\\\\.]\",\"_\"),\".csv\") as ?filename)
	BIND(UUID() as ?configiri)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/577> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/576> a <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#encodeRdf> true;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#encodeRdfControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#passwordControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#threads> 1;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#threadsControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#timeLimit> 10000;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#timeLimitControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#useAuthentication>
      false;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#useAuthenticationControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#useTolerantRepository>
      false;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#useTolerantRepositoryControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointChunkedList#userNameControl>
      <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/628> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/627> a <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#query> """PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcat: <http://www.w3.org/ns/dcat#>
INSERT { 
  ?theme skos:inScheme ?scheme .
} 
WHERE 
{
  {
  ?dataset dcat:theme ?theme .
  FILTER(STRSTARTS(STR(?theme), \"http://eurovoc.europa.eu/\"))
  BIND(<http://eurovoc.europa.eu/> AS ?scheme)
  }
  UNION
  {
  ?dataset dcat:theme ?theme .
  FILTER(STRSTARTS(STR(?theme), \"http://publications.europa.eu/resource/authority/data-theme/\"))
  BIND(<http://publications.europa.eu/resource/authority/data-theme> AS ?scheme)
  }  
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/644> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/643> a <http://plugins.linkedpipes.com/ontology/t-jsonLdToRdf#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-jsonLdToRdf#commitSize> 50000;
    <http://plugins.linkedpipes.com/ontology/t-jsonLdToRdf#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonLdToRdf#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-jsonLdToRdf#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/665> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/27/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#outputMode> <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#createNewChunk>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#outputModeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX schema: <http://schema.org/>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>


CONSTRUCT {
  ?catalog dcat:dataset ?dataset_new .

  ?dataset_new a dcat:Dataset ;
    dcterms:title ?title ;
    dcterms:description ?description ;
    dcat:theme ?theme ;
    dcterms:accrualPeriodicity ?accrualPeriodicity ;
    dcat:keyword ?keyword ;
    dcterms:spatial ?spatial ;
    dcterms:temporal ?temporal_new ;
    dcat:contactPoint ?cp_new ;
    foaf:page ?page ;
    dcterms:issued ?issued ;
    dcterms:conformsTo ?conformsTo ;
    dcat:spatialResolutionInMeters ?spatialResolution ;
    dcat:temporalResolution ?temporalResolution ;
    dcterms:isPartOf ?topDatasetNew ;
    dcat:distribution ?distribution_new ;
    dcterms:publisher ?publisher ;
    dcterms:identifier ?dataset_old_str .

  ?cp_new a ?cptype; 
    vcard:fn ?cpfn ;
    vcard:hasEmail ?cpemail .

  ?temporal_new a dcterms:PeriodOfTime; 
    dcat:startDate ?finalStartDate ;
    dcat:endDate ?finalEndDate .

  ?publisher a foaf:Agent, foaf:Organization;
    foaf:name ?pname .

  ?distribution_new a dcat:Distribution ;
    dcat:downloadURL ?ddURL ;
    dcat:accessURL ?daURL ;
    dcterms:format ?dformat ;
    dcat:mediaType ?dmimeType ;
    dcterms:conformsTo ?dconformsTo ;
    dcat:compressFormat ?dcompressFormat ;
    dcat:packageFormat ?dpackageFormat ;
    dcterms:title ?dtitle ;
    dcterms:license ?license .

  ?distribution_new dcat:accessService ?dataservice_new . 
  ?dataservice_new a dcat:DataService ;
    dcterms:title ?sTitle ;
    dcterms:conformsTo ?sConformsTo ;
    dcat:endpointURL ?sEndpointURL ;
    dcat:endpointDescription ?sEndpointDescription .

  ?record_new a dcat:CatalogRecord;
    dcterms:source ?dataset ;
    foaf:primaryTopic ?dataset_new ;
    dcterms:language <http://publications.europa.eu/resource/authority/language/SVK>, <http://publications.europa.eu/resource/authority/language/ENG> ;
    dcterms:conformsTo <https://joinup.ec.europa.eu/collection/semantic-interoperability-community-semic/solution/dcat-application-profile-data-portals-europe/release/201-0> .
}
WHERE {
  ?catalog a dcat:Catalog ;
             dcat:dataset ?dataset ;
             dcterms:publisher ?publisher .

  ?publisher foaf:name ?pname .

  ?dataset a dcat:Dataset ;
             dcterms:title ?title ;
             dcterms:description ?description ;
             dcat:theme ?theme ;
             dcterms:accrualPeriodicity ?accrualPeriodicity ;
             dcat:keyword ?keyword ;
             dcterms:spatial ?spatial .

  FILTER(isIRI(?spatial) && isIRI(?theme) && isIRI(?accrualPeriodicity))
  OPTIONAL { ?dataset dcterms:temporal ?temporal . 
    OPTIONAL { 
      ?temporal dcat:startDate ?startDate .
      FILTER(REGEX(STR(?startDate), \"[0-9]{4}-[0-9]{2}-[0-9]{2}\") && DATATYPE(?startDate) = xsd:date)
    }
    OPTIONAL { 
      ?temporal dcat:endDate ?endDate . 
      FILTER(REGEX(STR(?endDate), \"[0-9]{4}-[0-9]{2}-[0-9]{2}\") && DATATYPE(?endDate) = xsd:date)
    }
    OPTIONAL { 
      ?temporal schema:startDate ?schemaStartDate . 
      FILTER(REGEX(STR(?schemaStartDate), \"[0-9]{4}-[0-9]{2}-[0-9]{2}\") && DATATYPE(?schemaStartDate) = xsd:date)
    }
    OPTIONAL { 
      ?temporal schema:endDate ?schemaEndDate . 
      FILTER(REGEX(STR(?schemaEndDate), \"[0-9]{4}-[0-9]{2}-[0-9]{2}\") && DATATYPE(?schemaEndDate) = xsd:date)
    }
    BIND(IF(BOUND(?startDate), ?startDate, ?schemaStartDate) AS ?finalStartDate)
    BIND(IF(BOUND(?endDate), ?endDate, ?schemaEndDate) AS ?finalEndDate)
  }

  OPTIONAL { ?dataset dcat:contactPoint ?cp . 
    ?cp a ?cptype.
    OPTIONAL { ?cp vcard:fn ?cpfn . }
    OPTIONAL { 
      ?cp vcard:hasEmail ?cpemail . 
      FILTER(isIRI(?cpemail))
    }
  }

  OPTIONAL { 
    ?dataset foaf:page ?page . 
    FILTER(isIRI(?page))
  }
  OPTIONAL { 
    ?dataset dcterms:conformsTo ?conformsTo . 
    FILTER(isIRI(?conformsTo))
  }
  OPTIONAL { ?dataset dcat:spatialResolutionInMeters ?spatialResolution . }
  OPTIONAL { ?dataset dcat:temporalResolution ?temporalResolution . }
  OPTIONAL { 
    ?dataset dcterms:isPartOf ?topDataset . 
    FILTER(isIRI(?topDataset))
  }

  OPTIONAL {
    ?dataset dcat:distribution ?distribution .
    ?distribution a dcat:Distribution ;
             dcat:accessURL ?daURL .
             
    OPTIONAL { ?distribution dcterms:license ?license . }
    OPTIONAL { ?distribution dcat:downloadURL ?ddURL . }
    OPTIONAL { 
      ?distribution dcterms:format ?dformat . 
      FILTER(isIRI(?dformat))
    }
    OPTIONAL { 
      ?distribution dcat:mediaType ?dmimeType . 
      FILTER(isIRI(?dmimeType))
    }
    OPTIONAL { 
      ?distribution dcterms:conformsTo ?dconformsTo . 
      FILTER(isIRI(?dconformsTo))
    }
    OPTIONAL { 
      ?distribution dcat:compressFormat ?dcompressFormat . 
      FILTER(isIRI(?dcompressFormat))
    }
    OPTIONAL { 
      ?distribution dcat:packageFormat ?dpackageFormat . 
      FILTER(isIRI(?dpackageFormat))
    }
    OPTIONAL { ?distribution dcterms:title ?dtitle . }  
    OPTIONAL { 
      ?distribution dcat:accessService ?dataService . 
      ?dataService a dcat:DataService ;
                    dcterms:title ?sTitle ;
                    dcat:endpointURL ?sEndpointURL .
      OPTIONAL { 
        ?dataService dcat:endpointDescription ?sEndpointDescription .
        FILTER(isIRI(?sEndpointDescription))
      }
      OPTIONAL { 
        ?dataService dcterms:conformsTo ?sConformsTo .
        FILTER(isIRI(?sConformsTo))
      }
      FILTER(isIRI(?sEndpointURL))
    }
  }

  BIND (STRDT(STR(?dataset), xsd:anyURI) AS ?dataset_old_str)
  BIND (CONCAT(\"https://data.gov.sk/set/dataset/\") AS ?new_IRI_base)
  BIND (MD5(CONCAT(STR(?dataset), STR(?publisher))) AS ?datasetID)
  BIND (IRI(CONCAT(?new_IRI_base, ?datasetID)) as ?dataset_new)
  BIND (IRI(CONCAT(?new_IRI_base, MD5(CONCAT(STR(?topDataset), STR(?publisher))))) as ?topDatasetNew)
  BIND (IRI(CONCAT(\"https://data.gov.sk/set/distribution/\", ?datasetID, \"/\", MD5(STR(?distribution)))) as ?distribution_new)
  BIND (IRI(CONCAT(\"https://data.gov.sk/set/data-service/\", MD5(CONCAT(STR(?dataService), STR(?publisher))))) as ?dataservice_new)
  BIND (IRI(CONCAT(STR(?dataset_new),\"/záznam\")) as ?record_new)
  BIND (IRI(CONCAT(STR(?dataset_new),\"/kontaktný-bod\")) as ?cp_new)
  BIND (IRI(CONCAT(STR(?dataset_new),\"/časové-pokrytie\")) as ?temporal_new)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/676> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/675> a <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>
DELETE { 
  ?dataset dcat:contactPoint ?cp .
} 
WHERE 
{
   ?dataset dcat:contactPoint ?cp .
  FILTER NOT EXISTS { ?cp vcard:fn|vcard:hasEmail [] .}
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/693> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/71/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX ss: <http://plugins.linkedpipes.com/ontology/t-sparqlSelectMultiple#> 

CONSTRUCT { 
  ?configiri a ss:Configuration ;
    ss:query ?query ;
    ss:fileName ?filename .
} 
WHERE { 
  {
    SELECT DISTINCT ?catalog WHERE {?catalog dcat:dataset [] . }
  }

  BIND(CONCAT(\"\"\"
PREFIX dcat: <http://www.w3.org/ns/dcat#>
SELECT ?dataset
WHERE {
<\"\"\",STR(?catalog),\"\"\"> dcat:dataset ?dataset .
}
\"\"\") as ?query)

  BIND(CONCAT(REPLACE(STR(?catalog),\"[:/\\\\.]\",\"_\"),\".csv\") as ?filename)
  BIND(UUID() as ?configiri)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/695> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/694> a <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#detailLog> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#detailLogControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#encodeUrl> false;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#encodeUrlControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#hardRedirect> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#hardRedirectControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#skipOnError> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#skipOnErrorControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threads> 20;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsPerGroup> 2;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsPerGroupControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#timeout> 120000;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#timeoutControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/696> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/636> a <http://plugins.linkedpipes.com/ontology/t-chunkedToGraph#Configuration> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/705> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/205/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dcterms: <http://purl.org/dc/terms/>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>
PREFIX httpList: <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#>

CONSTRUCT {
<http://localhost/resource/configuration> a httpList:Configuration ;
    httpList:reference ?catalog .

?catalog a dcat:Catalog, httpList:Reference ;
    dcat:endpointURL ?endpoint ;
    httpList:fileUri ?endpoint ;
    httpList:fileName ?filename ;
    httpList:header #?acceptHeader,
      ?agentHeader .
  
#?acceptHeader a httpList:Header ;
#    httpList:key \"Accept\" ;
#    httpList:value \"text/turtle\" .

?agentHeader a httpList:Header ;
    httpList:key \"User-Agent\" ;
    httpList:value \"nkod/0.0.1\" .
}
WHERE {
  ?catalog a dcat:Catalog, nkod:DcatApLkod ;
           dcat:endpointURL ?endpoint .
  
  BIND(REPLACE(STR(?catalog),\"[:/\\\\?#&]\",\"-\") as ?filename)
  #BIND(IRI(CONCAT(STR(?catalog),\"/accept-header\")) as ?acceptHeader)
  BIND(IRI(CONCAT(STR(?catalog),\"/agent-header\")) as ?agentHeader)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/720> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/93/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSize> 100;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicateControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReference> false;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReferenceControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeType> "application/ld+json";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/730> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/729> a <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#detailLog> false;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#detailLogControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#encodeUrl> false;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#encodeUrlControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#hardRedirect> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#hardRedirectControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#retryCountControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#skipOnError> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#skipOnErrorControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threads> 64;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsPerGroup> 10;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsPerGroupControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#timeout> 5000;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#timeoutControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#utf8Redirect> false;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#utf8RedirectControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#waitTimeControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/731> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/589> a <http://plugins.linkedpipes.com/ontology/t-chunkedToGraph#Configuration> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/733> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/123/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX esl: <http://plugins.linkedpipes.com/ontology/e-sparqlEndpointList#>
PREFIX nkod: <https://data.gov.sk/slovník/nkod/>

CONSTRUCT 
{ 
  ?catalog a esl:Task ;
    esl:query ?query ;
    esl:group ?uritext ;
    esl:endpoint ?uritext ;
} 
WHERE { 
  ?catalog a dcat:Catalog, nkod:DcatApSparql ;
    dcat:endpointURL ?endpoint .

  BIND(STR(?endpoint) as ?uritext)

  BIND(CONCAT(\"\"\"PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

CONSTRUCT {
<\"\"\", STR(?catalog), \"\"\"> dcat:endpointURL \\\"\"\"\",?uritext,\"\"\"\\\"^^xsd:anyURI ;
dcat:dataset ?dataset .
} WHERE {
?dataset a dcat:Dataset .
}\"\"\") as ?query)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/747> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/746> a <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#query> """PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcat: <http://www.w3.org/ns/dcat#>
DELETE { 
  ?dataset dcat:theme ?theme .
} 
WHERE 
{
  ?dataset dcat:theme ?theme .
  FILTER NOT EXISTS {
    ?theme skos:inScheme [] . 
  }
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFail> false;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-sparqlUpdateChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/754> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/753> a <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSize> 1;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicate> <https://etl.linkedpipes.com/plugins/t-filestochunked/fileName>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicateControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReference> false;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReferenceControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeType> "application/ld+json";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/762> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/107/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSize> 10;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#commitSizeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicate> <https://etl.linkedpipes.com/plugins/t-filestochunked/fileName>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#filePredicateControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReference> false;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#fileReferenceControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeType> "";
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#mimeTypeControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFail> true;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#softFailControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threads> 8;
    <http://plugins.linkedpipes.com/ontology/t-filesToRdfChunked#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/774> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/522> a <http://plugins.linkedpipes.com/ontology/t-chunkedToTurtle#Configuration> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/776> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/106/configuration>
    a <http://plugins.linkedpipes.com/ontology/e-filesFromLocal#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-filesFromLocal#path> "/data/registrace/lkody";
    <http://plugins.linkedpipes.com/ontology/e-filesFromLocal#pathControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/778> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/266/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#context> """{
\"@vocab\":\"https://data.gov.sk/slovník/nkod/\"
 }""";
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#contextControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#dataPredicate> <https://data.gov.sk/slovník/nkod/data>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#dataPredicateControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#encoding> "UTF-8";
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#encodingControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#filePredicate> <https://data.gov.sk/slovník/nkod/filePredicate>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#filePredicateControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#fileReference> true;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#fileReferenceControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#type> <https://data.gov.sk/slovník/nkod/Data>;
    <http://plugins.linkedpipes.com/ontology/t-jsonToJsonLd#typeControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/787> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/84/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#deduplication>
      true;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#deduplicationControl>
      <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#prefixTurtle>
      """@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .
@prefix foaf: <http://xmlns.com/foaf/0.1/> .
@prefix language: <http://publications.europa.eu/resource/authority/language/> .
@prefix filetype: <http://publications.europa.eu/resource/authority/file-type/> .
@prefix theme: <http://publications.europa.eu/resource/authority/data-theme/> .
@prefix country: <http://publications.europa.eu/resource/authority/country/> .
@prefix dcat: <http://www.w3.org/ns/dcat#> .
@prefix dct: <http://purl.org/dc/terms/> .
@prefix skos: <http://www.w3.org/2004/02/skos/core#> .
@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .
@prefix application: <http://www.iana.org/assignments/media-types/application/> .
@prefix text: <http://www.iana.org/assignments/media-types/text/> .
@prefix eurovoc: <http://eurovoc.europa.eu/> .
@prefix dap201: <https://joinup.ec.europa.eu/collection/semantic-interoperability-community-semic/solution/dcat-application-profile-data-portals-europe/release/201-0> .""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#prefixTurtleControl>
      <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/800> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/799> a <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#Configuration>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#detailLog> false;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#detailLogControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#encodeUrl> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#encodeUrlControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#hardRedirect> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#hardRedirectControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#retryCountControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#skipOnError> true;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#skipOnErrorControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threads> 20;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsPerGroup> 1;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#threadsPerGroupControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#timeout> 60000;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#timeoutControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#utf8Redirect> false;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#utf8RedirectControl> <http://plugins.linkedpipes.com/resource/configuration/None>;
    <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#waitTimeControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/812> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/275/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>
PREFIX httpList: <http://plugins.linkedpipes.com/ontology/e-httpGetFiles#>

CONSTRUCT {
<http://localhost/resource/configuration> a httpList:Configuration ;
    httpList:reference ?catalog .

?catalog a httpList:Reference ;
    httpList:fileUri ?endpoint ;
    httpList:fileName ?filename ;
    httpList:header ?agentHeader ;
    nkod:catalog ?catalog .
  
?agentHeader a httpList:Header ;
    httpList:key \"User-Agent\" ;
    httpList:value \"nkod/0.0.1\" .
}
WHERE {
  ?catalog a dcat:Catalog, nkod:CkanApiLkod ;
           dcat:endpointURL ?endpoint .
  
  FILTER(STRENDS(STR(?endpoint), \"package_list\"))
  
  BIND(REPLACE(STR(?catalog),\"[:/\\\\?#&]\",\"-\") as ?filename)
  BIND(IRI(CONCAT(STR(?catalog),\"/agent-header\")) as ?agentHeader)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/814> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/813> a <http://plugins.linkedpipes.com/ontology/t-sparqlSelectMultiple#Configuration> .
}

<https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/graph/818> {
  <https://sk-nkod.opendata.cz/etl/resources/pipelines/1654002010184/169/configuration>
    a <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#Configuration>;
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#query> """PREFIX srtfl: <http://plugins.linkedpipes.com/ontology/t-sparqlConstructToFileList#>
PREFIX dcat: <http://www.w3.org/ns/dcat#>

CONSTRUCT 
{
<https://localhost/nkod-task> a srtfl:Task ;
    srtfl:fileName \"nkod.trig\" ;
    srtfl:fileFormat \"application/trig\" ;
    srtfl:hasTaskQuery ?tqIRI .

?tqIRI a srtfl:TaskQuery ;
    srtfl:outputGraph ?dataset ;
    srtfl:query ?query .
} 

WHERE 
{ 
?dataset a dcat:Dataset .

BIND(UUID() as ?tqIRI)
  #Dataset is generated as a constant becasue using VALUES has way longer execution time
BIND(CONCAT(\"\"\"
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX foaf: <http://xmlns.com/foaf/0.1/>
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>
PREFIX locn: <http://www.w3.org/ns/locn#>

PREFIX nkod: <https://data.gov.sk/slovník/nkod/>

CONSTRUCT {
?catalog dcat:dataset <\"\"\",STR(?dataset),\"\"\"> ;
         dcat:record ?record.

<\"\"\",STR(?dataset),\"\"\"> a dcat:Dataset ;
    dcterms:title ?title ;
    dcterms:description ?description ;
	dcat:theme ?theme ;
	dcterms:accrualPeriodicity ?accrualPeriodicity ;
	dcat:keyword ?keyword ;
    dcterms:spatial ?spatial ;
    dcterms:temporal ?temporal ;
	dcat:contactPoint ?cp ;
	foaf:page ?page ;
    dcterms:conformsTo ?conformsTo ;
    dcat:spatialResolutionInMeters ?spatialResolution ;
    dcat:temporalResolution ?temporalResolution ;
    dcterms:isPartOf ?topDataset ;
    dcterms:hasPart ?lowerDataset ;
    dcterms:publisher ?publisher ;
	dcterms:identifier ?identifier ;
	dcat:distribution ?distribution .

?spatial a dcterms:Location ;
    locn:geometry ?geo .

?cp a ?cptype; 
    vcard:fn ?cpfn ;
    vcard:hasEmail ?cpemail .

?publisher a foaf:Agent; 
	foaf:name ?name .

?temporal a dcterms:PeriodOfTime; 
    dcat:startDate ?startDate ;
    dcat:endDate ?endDate .

?theme skos:inScheme ?scheme .

?distribution a dcat:Distribution ;
    dcat:downloadURL ?ddURL ;
    dcat:accessURL ?daURL ;
    dcterms:format ?dformat ;
	dcat:mediaType ?dmimeType ;
	dcterms:conformsTo ?dconformsTo ;
    dcat:compressFormat ?dcompressFormat ;
    dcat:packageFormat ?dpackageFormat ;
    dcterms:title ?dtitle ;
	dcterms:license ?license .

?distribution dcat:accessService ?dataService . 
  
?dataService a dcat:DataService ;
    dcterms:title ?sTitle ;
    dcterms:conformsTo ?sConformsTo ;
    dcat:endpointURL ?sEndpointURL ;
    dcat:endpointDescription ?sEndpointDescription ;
    dcat:servesDataset <\"\"\",STR(?dataset),\"\"\"> .

?record a dcat:CatalogRecord;
    foaf:primaryTopic <\"\"\",STR(?dataset),\"\"\"> ;
    dcterms:language ?rlanguage ;
    dcterms:conformsTo ?rconformsTo ;
    dcterms:source ?rsource .
}
WHERE {
  {
	<\"\"\",STR(?dataset),\"\"\"> a dcat:Dataset ;
        dcterms:title ?title .
  } UNION {
    <\"\"\",STR(?dataset),\"\"\"> dcterms:description ?description .
  } UNION { 
    <\"\"\",STR(?dataset),\"\"\"> dcat:distribution ?distribution .

    ?distribution a dcat:Distribution ;
        dcat:accessURL ?daURL .

    OPTIONAL { ?distribution dcat:downloadURL ?ddURL . }
	OPTIONAL { ?distribution dcterms:license ?license . }
    OPTIONAL { ?distribution dcterms:description ?ddescription . }
    OPTIONAL { ?distribution dcterms:format ?dformat . }
    OPTIONAL { ?distribution dcat:mediaType ?dmimeType . }
    OPTIONAL { ?distribution dcterms:conformsTo ?dconformsTo . }
    OPTIONAL { ?distribution dcat:compressFormat ?dcompressFormat . }
    OPTIONAL { ?distribution dcat:packageFormat ?dpackageFormat . }
    OPTIONAL { ?distribution dcterms:title ?dtitle . }
    OPTIONAL { 
        ?distribution dcat:accessService ?dataService . 
        ?dataService a dcat:DataService ;
                    dcterms:title ?sTitle ;
                    dcat:endpointURL ?sEndpointURL .
        OPTIONAL { ?dataService dcat:endpointDescription ?sEndpointDescription .}
        OPTIONAL { ?dataService dcterms:conformsTo ?sConformsTo .}
    }
  } UNION { ?catalog dcat:dataset <\"\"\",STR(?dataset),\"\"\"> . 
  } UNION {
    ?catalog dcat:dataset <\"\"\",STR(?dataset),\"\"\"> ;
            dcat:record ?record .

    ?record a dcat:CatalogRecord;
                foaf:primaryTopic <\"\"\",STR(?dataset),\"\"\"> .
    OPTIONAL { ?record dcterms:language ?rlanguage . }
    OPTIONAL { ?record dcterms:conformsTo ?rconformsTo . }
    OPTIONAL { ?record dcterms:source ?rsource . }
  } UNION {
<\"\"\",STR(?dataset),\"\"\"> dcterms:hasPart ?lowerDataset .
  } UNION {
<\"\"\",STR(?dataset),\"\"\"> dcterms:hasPart ?lowerDataset .
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcterms:accrualPeriodicity ?accrualPeriodicity .   } UNION { <\"\"\",STR(?dataset),\"\"\"> dcat:keyword ?keyword . 
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcterms:spatial ?spatial .
    OPTIONAL { ?spatial locn:geometry ?geometry . }
  } UNION { <\"\"\",STR(?dataset),\"\"\"> foaf:page ?page . 
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcterms:conformsTo ?conformsTo . 
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcat:spatialResolutionInMeters ?spatialResolution . 
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcat:temporalResolution ?temporalResolution . 
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcterms:isPartOf ?topDataset . 
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcterms:identifier ?identifier . 
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcat:theme ?theme .
	OPTIONAL { ?theme skos:inScheme ?scheme . }
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcterms:temporal ?temporal . 
    OPTIONAL { ?temporal dcat:startDate ?startDate . }
    OPTIONAL { ?temporal dcat:endDate ?endDate . }
  } UNION { <\"\"\",STR(?dataset),\"\"\"> dcat:contactPoint ?cp . 
?cp a ?cptype.
    OPTIONAL { ?cp vcard:fn ?cpfn . }
    OPTIONAL { ?cp vcard:hasEmail ?cpemail . }
  } UNION { 
    <\"\"\",STR(?dataset),\"\"\"> dcterms:publisher ?publisher . 
	
    ?publisher a foaf:Agent; 
        foaf:name ?name .
    }
}
\"\"\") as ?query)
}""";
    <http://plugins.linkedpipes.com/ontology/t-sparqlConstruct#queryControl> <http://plugins.linkedpipes.com/resource/configuration/None> .
}
